Tekla Open API Reference for Tekla Structures 2025
InputDefinitionFactory.GetPoints Method
 Gets the points from the given n-point input.
 Namespace: Tekla.Structures.Drawing.Tools
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static PointList GetPoints(
	DrawingPluginBase.InputDefinition input
)
Public Shared Function GetPoints (
	input As DrawingPluginBase.InputDefinition
) As PointList
Parameters
input
Type: Tekla.Structures.Plugins.DrawingPluginBase.InputDefinition
The input.
Return Value
Type: PointList
The points.
See Also
Reference
InputDefinitionFactory Class
Tekla.Structures.Drawing.Tools Namespace